arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
/*
 * brief Flash command sequence.
 *
 * This API is used to perform command write sequence on  Flash.
 * It is internal function, called by driver APIs only.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * return Successful completion (FTFx_OK)
 * return Failed in Flash command execution (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL,
 * FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashCommandSequence (const PFLASH_SSD_CONFIG pSSDConfig)

{
    flash_drv_status_t ret;       /* return code variable */

    /* clear CCIF to launch command */
    FTFx_FSTAT |= (FTFx_FSTAT_CCIF_MASK);

    while(0x0U == (FTFx_FSTAT & FTFx_FSTAT_CCIF_MASK))
    {
        /* wait till CCIF bit is set */
        /* serve callback function if counter reaches limitation */
        if(NULL_CALLBACK != pSSDConfig->CallBack)
        {
            (pSSDConfig->CallBack)();
        }
    }

    ret = ((flash_drv_status_t)(FTFx_FSTAT & (FTFx_FSTAT_MGSTAT0_MASK | FTFx_FSTAT_FPVIOL_MASK \
                                                | FTFx_FSTAT_ACCERR_MASK | FTFx_FSTAT_RDCOLERR_MASK)));
    return(ret);
}
/*
 * brief P-Flash get protection.
 *
 * This  API  retrieves  the current  P-Flash  protection  status.  Considering
 * the  time  consumption  for getting protection is very  low and even can
 * be  ignored. It is not necessary to utilize the Callback function to
 * support the time-critical events.
 *
 * param protectStatus: To return the current value of the P-Flash Protection.
 *                       Each bit is corresponding
 *                       to protection of 1/32 of the total P-Flash. The least
 *                       significant bit is corresponding to the lowest
 *                       address area of P-Flash. The most significant bit
 *                       is corresponding to the highest address area of P-
 *                       Flash and so on. There are two possible cases as below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * return
 */
void PFlashGetProtection(uint32_t* protectStatus)
{
    uint32_t reg0, reg1, reg2, reg3;

    reg0 = FTFx_FPROT0;
    reg1 = FTFx_FPROT1;
    reg2 = FTFx_FPROT2;
    reg3 = FTFx_FPROT3;

    *protectStatus = (uint32_t)((uint32_t)(reg0 << 24) | (uint32_t)(reg1 << 16) | (uint32_t)(reg2 << 8) | reg3);

}

/*
 * brief P-Flash set protection.
 *
 * This API sets the P-Flash protection to the intended protection status.
 * Setting P-Flash protection status is subject to a protection transition
 * restriction. If there is a setting violation, it  returns
 * an error code and the current protection status won’t be changed.
 *
 * param protectStatus: The expected protect status user wants to set to
 *                       P-Flash protection register. Each bit is corresponding
 *                       to protection of 1/32 of the total P-Flash. The least
 *                       significant bit is corresponding to the lowest
 *                       address area of P-Flash. The most significant bit
 *                       is corresponding to the highest address area of P-
 *                       Flash, and so on. There are two possible cases as shown below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * return Successful completion (FTFx_OK )
 * return Error value (FTFx_ERR_CHANGEPROT)
 */
flash_drv_status_t PFlashSetProtection(uint32_t protectStatus)
{
    flash_drv_status_t ret = FTFx_OK;
    uint8_t reg0, reg1, reg2, reg3;

    reg0 = GET_BIT_24_31(protectStatus);
    reg1 = GET_BIT_16_23(protectStatus);
    reg2 = GET_BIT_8_15(protectStatus);
    reg3 = GET_BIT_0_7(protectStatus);

     FTFx_FPROT0 = reg0;
     FTFx_FPROT1 = reg1;
     FTFx_FPROT2 = reg2;
     FTFx_FPROT3 = reg3;

    /* Read the value of FPPROT registers */
    if ((FTFx_FPROT0 != reg0) || (FTFx_FPROT1 != reg1) || (FTFx_FPROT2 != reg2) || (FTFx_FPROT3 != reg3))
    {
        ret = FTFx_ERR_CHANGEPROT;
    }
    return(ret);
}

/*
 * brief Flash get security state.
 *
 * This API retrieves the current Flash security status, including
 * the security enabling state and the back door key enabling state.
 *
 * param securityState: To return the current security status code.
 *                       FLASH_NOT_SECURE (0x01): Flash currently not in secure state
 *                       FLASH_SECURE_BACKDOOR_ENABLED (0x02): Flash is secured and
 *                       back door key access enabled
 *                       FLASH_SECURE_BACKDOOR_DISABLED (0x04): Flash is secured and
 *                       back door key access disabled.
 * return
 */
void FlashGetSecurityState(uint8_t* securityState)
{
    /* store data read from flash register */
    uint8_t  regValue;
    /*Get flash security register value */
    regValue = FTFx_FSEC;

    /* check the status of the flash security bits in the security register */
    if(FLASH_SECURITY_STATE_UNSECURED == (regValue & FTFx_FSEC_SEC_MASK))
    {
        /* Flash in unsecured state */
        *securityState = FLASH_NOT_SECURE;
    }
    else
    {
        /* Flash in secured state */
        /* check for backdoor key security enable bit */
        if(0x80U == (regValue & FTFx_FSEC_KEYEN_MASK))
        {
            /* Backdoor key security enabled */
            *securityState = FLASH_SECURE_BACKDOOR_ENABLED;
        }
        else
        {
            /* Backdoor key security disabled */
            *securityState = FLASH_SECURE_BACKDOOR_DISABLED;
        }
    }
}

/*
 * brief Flash security bypass.
 *
 * This API un-secures the device by comparing the user's provided back
 * door key with the ones in  the Flash Configuration Field.  If  they are
 * matched,  the  security is  released. Otherwise, an
 * error code is returned.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param keyBuffer:     Point to the user buffer containing the back door key.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashSecurityBypass(const PFLASH_SSD_CONFIG pSSDConfig, \
                           const uint8_t* keyBuffer, \
                           pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret;      /* return code variable */
    uint32_t temp;     /* temporary variable */
    uint8_t i;

