arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
    /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;

    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_SECURITY_BY_PASS;
    for (i = 0x0U; i < 0x08U; i++)
    {
        temp = FTFx_BASE + i + 0x08U;
        *(uint8_t *) (temp) = keyBuffer[i];
    }
    ret = pFlashCommandSequence(pSSDConfig);

    return(ret);
}

/*
 * brief Flash erase all Blocks.
 *
 * This API  erases all Flash memory,  initializes  the FlexRAM, verifies
 * all memory contents, and then releases the MCU security.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashEraseAllBlock (const PFLASH_SSD_CONFIG pSSDConfig, \
                       pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret;         /* return code variable */

    /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_ERASE_ALL_BLOCK;

    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);
    return(ret);
}

/*
 * brief Flash verify all Blocks.
 *
 * This function checks to see if the P-Flash and/or D-Flash, EEPROM
 * backup area, and D-Flash IFR have been erased to the specified read
 * margin level, if applicable, and releases security if the readout passes.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param marginLevel:   Read Margin Choice as follows:
 *                       marginLevel = 0x0: use the Normal read level
 *                       marginLevel = 0x1: use the User read
 *                       marginLevel = 0x2: use the Factory read
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashVerifyAllBlock(const PFLASH_SSD_CONFIG pSSDConfig, \
                           uint8_t marginLevel, \
                           pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret;         /* return code variable */
   /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_VERIFY_ALL_BLOCK;
    FTFx_FCCOB1 = marginLevel;
    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);

    return(ret);
}
/*
 * brief Flash erase sector.
 *
 * This API erases one or more sectors in P-Flash or  D-Flash memory.
 * This  API  always  returns  FTFx_OK  if  size  provided  by  the user  is
 * zero  regardless  of  the  input validation.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Address in the first sector to be erased.
 * param size:          Size to be erased in bytes. It is used to determine
 *                       number of sectors to be erased.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR, FTFx_ERR_PVIOL,FTFx_ERR_SIZE)
 */
flash_drv_status_t FlashEraseSector(const PFLASH_SSD_CONFIG pSSDConfig, \
                        uint32_t dest, \
                        uint32_t size, \
                        pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{

    flash_drv_status_t ret = FTFx_OK;     /* return code variable */
    uint32_t sectorSize;        /* size of one sector */
    uint32_t temp;              /* temporary variable */


#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
    temp = pSSDConfig->DFlashBase;
    if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
    {
        dest = dest - temp + 0x800000U;
        sectorSize = (uint32_t)FSL_FEATURE_FLASH_FLEX_NVM_BLOCK_SECTOR_SIZE;
    }
    else
#endif
    {
        temp = pSSDConfig->PFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
        {
            dest -= temp;
            sectorSize = (uint32_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_SECTOR_SIZE;
        }
        else
        {
            ret = FTFx_ERR_ACCERR;
            size = 0x0U;
        }
    }

    /* check if the size is sector alignment or not */
    if((size & (sectorSize - 0x01U)) != 0x0U)
    {
        /* return an error code FTFx_ERR_SIZE */
        ret = FTFx_ERR_SIZE;
    }

    while((size > 0x0U) && (FTFx_OK == ret))
    {
        /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
        CLEAR_FTFx_FSTAT_ERROR_BITS;
        /* passing parameter to the command */
        FTFx_FCCOB0 = FTFx_ERASE_SECTOR;
        FTFx_FCCOB1 = GET_BIT_16_23(dest);
        FTFx_FCCOB2 = GET_BIT_8_15(dest);
        FTFx_FCCOB3 = GET_BIT_0_7(dest);

        /* calling flash command sequence function to execute the command */
        ret = pFlashCommandSequence(pSSDConfig);

        /* update size and destination address */
        size -= sectorSize;
        dest += sectorSize;

    }
    return(ret);
}
/*
 * brief Flash verify sections.
 *
 * This API  checks  if a section of the P-Flash or the D-Flash memory
 * is erased  to  the specified read margin level.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended verify operation.
 * param number:        Number of alignment unit to be verified. Refer to
 *                       corresponding reference manual to get correct
 *                       information of alignment constrain.
 * param marginLevel:   Read Margin Choice as follows:
 *                       marginLevel = 0x0: use Normal read level
 *                       marginLevel = 0x1: use the User read
 *                       marginLevel = 0x2: use the Factory read
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */

flash_drv_status_t FlashVerifySection(const PFLASH_SSD_CONFIG pSSDConfig, \
                          uint32_t dest, \
                          uint16_t number, \
                          uint8_t marginLevel, \
                          pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret = FTFx_OK;      /* return code variable */
    uint32_t temp;

    /* check if the destination is aligned or not */
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
    temp = pSSDConfig->DFlashBase;
    if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
    {
        dest = dest - temp + 0x800000U;
    }
    else
#endif
    {
        temp = pSSDConfig->PFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
        {
            dest -= temp;
        }
        else
        {
            ret = FTFx_ERR_ACCERR;
        }
    }
    if(FTFx_OK == ret)
    {
       /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
        CLEAR_FTFx_FSTAT_ERROR_BITS;
        /* passing parameter to the command */
        FTFx_FCCOB0 = FTFx_VERIFY_SECTION;
        FTFx_FCCOB1 = GET_BIT_16_23(dest);
        FTFx_FCCOB2 = GET_BIT_8_15(dest);
        FTFx_FCCOB3 = GET_BIT_0_7(dest);
        FTFx_FCCOB4 = GET_BIT_8_15(number);
        FTFx_FCCOB5 = GET_BIT_0_7(number);
        FTFx_FCCOB6 = marginLevel;

        /* calling flash command sequence function to execute the command */
        ret = pFlashCommandSequence(pSSDConfig);
    }
    return(ret);
}
/*
 * brief Flash erase suspend.
 *
 * This API is used to suspend a current operation of Flash erase sector command.
 * This function must be located in RAM memory or different Flash blocks which are
 * targeted for writing to avoid the RWW error.
 *
 * param
 * return
 */
void FlashEraseSuspend(void)
{
    if((FTFx_FSTAT & FTFx_FSTAT_CCIF_MASK) == 0x0U)
    {
        FTFx_FCNFG |= FTFx_FCNFG_ERSSUSP_MASK;


        while((FTFx_FSTAT & FTFx_FSTAT_CCIF_MASK) == 0x0U)
        {
            /* wait till CCIF bit is set */
        }
    }
}
/*
 * brief Flash erase resume.
 *
 * This API is used to resume a previous suspended operation of Flash erase sector command
 * This function must be located in RAM memory or different Flash blocks which are targeted
 * for writing to avoid RWW error.
 *
 * param
 * return
 */
void FlashEraseResume(void)

{
    uint16_t i;         /* counter variable */
    i = 0x0U;

    /* check ERSSUSP bit of the flash configuration register */
    if((FTFx_FCNFG & FTFx_FCNFG_ERSSUSP_MASK) == FTFx_FCNFG_ERSSUSP_MASK)
    {
        /* clear CCIF to launch command */
        FTFx_FSTAT |= FTFx_FSTAT_CCIF_MASK;
        /* wait for completion of this command */
        while((0x0U == (FTFx_FSTAT & FTFx_FSTAT_CCIF_MASK)) || (i < RESUME_WAIT_CNT))
        {
            i++;
        }
    }
}
/*
 * brief Flash read once.
 *
 * This API is used to read out a reserved 64 byte field located in the P-Flash IFR via given number
 * of record. See the corresponding reference manual to get the correct value of this number.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param recordIndex:   The record index will be read. It can be from 0x0
 *                      to 0x7 or from 0x0 to 0xF according to specific derivative.
 * param pDataArray:    Pointer to the array to return the data read by the read once command.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashReadOnce(const PFLASH_SSD_CONFIG pSSDConfig, \
                    uint8_t recordIndex,\
                    uint8_t* pDataArray, \
                    pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    uint8_t i;
    flash_drv_status_t ret;       /* return code variable */
    uint32_t temp;      /* temporary variable */
   /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_READ_ONCE;
    FTFx_FCCOB1 = recordIndex;

    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);
    /* checking for the success of command execution */
    if(FTFx_OK == ret)
    {
        /* Read the data from the FCCOB registers into the pDataArray */
        for (i = 0x0U; i < FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE; i ++)
        {
            temp = FTFx_BASE + i + 0x08U;
            pDataArray[i] = *(uint8_t *)(temp);
        }
    }
    return(ret);
}
/*
 * brief Flash program once.
 *
 * This API  is  used  to  program  to  a  reserved  64  byte  field  located  in  the
 * P-Flash  IFR  via  given number of record. See the corresponding reference manual
 * to get correct value of this number.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param recordIndex:   The record index will be read. It can be from 0x0
 *                       to 0x7 or from 0x0 to 0xF according to specific derivative.
 * param pDataArray:    Pointer to the array from which data will be
 *                       taken for program once command.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR,FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashProgramOnce(const PFLASH_SSD_CONFIG pSSDConfig, \
                        uint8_t recordIndex,\
                        const uint8_t* pDataArray, \
                        pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{

    uint8_t i;
    flash_drv_status_t ret;         /* return code variable */
    uint32_t temp;        /* temporary variable */

