arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
    /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_PROGRAM_ONCE;
    FTFx_FCCOB1 = recordIndex;

    for (i = 0x0U; i < FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE; i ++)
    {
        temp = FTFx_BASE + i + 0x08U;
        *(uint8_t *)(temp) = pDataArray[i];
    }
    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);
    return(ret);
}
/*
 * brief Flash read resource.
 *
 * This API is used to read data from special purpose memory in Flash memory module
 * including P-Flash IFR, swap IFR, D-Flash IFR space and version ID.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended read operation.
 * param pDataArray:    Pointer to the data returned by the read resource command.
 * param resourceSelectCode:    Read resource select code:
 *                               0 : Flash IFR
 *                               1: Version ID
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashReadResource(const PFLASH_SSD_CONFIG pSSDConfig, \
                         uint32_t dest, \
                         uint8_t* pDataArray, \
                         uint8_t  resourceSelectCode, \
                         pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    uint8_t i;
    flash_drv_status_t ret = FTFx_OK;       /* return code variable */
    uint32_t temp;

    /* check if the destination is aligned or not */
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
    temp = pSSDConfig->DFlashBase;
    if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
    {
        dest = dest - temp + 0x800000U;
    }
    else
#endif
    {
        temp = pSSDConfig->PFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
        {
            dest -= temp;
        }
        else
        {
            ret = FTFx_ERR_ACCERR;
        }
    }
    if(ret == FTFx_OK)
    {
        /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear */
        CLEAR_FTFx_FSTAT_ERROR_BITS;
        /* passing parameter to the command */
        FTFx_FCCOB0 = FTFx_READ_RESOURCE;
        FTFx_FCCOB1 = GET_BIT_16_23(dest);
        FTFx_FCCOB2 = GET_BIT_8_15(dest);
        FTFx_FCCOB3 = GET_BIT_0_7(dest);
        FTFx_RSRC_CODE_REG = resourceSelectCode;
        /* calling flash command sequence function to execute the command */
        ret = pFlashCommandSequence(pSSDConfig);

        if (FTFx_OK == ret)
        {
            /* Read the data from the FCCOB registers into the pDataArray */
            for (i = 0x0U; i < FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE; i ++)
            {
                temp = FTFx_BASE + i + 0x08U;
                pDataArray[i] = *(uint8_t*)temp;
            }
        }
    }
    return(ret);
}
/*
 * brief Flash program
 *
 * This  API  is  used  to  program  4  consecutive  bytes  (for  program  long
 * word  command)  and  8 consecutive bytes (for program phrase command) on
 * P-Flash or D-Flash block. This  API  always  returns  FTFx_OK  if  size
 * provided  by  user  is  zero  regardless  of  the  input validation
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended program operation.
 * param size:          Size in byte to be programmed
 * param pData:         Pointer of source address from which data has to
 *                       be taken for program operation.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL, FTFx_ERR_SIZE, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashProgram(const PFLASH_SSD_CONFIG pSSDConfig, \
                    uint32_t dest, \
                    uint32_t size, \
                    uint8_t* pData, \
                    pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret = FTFx_OK;      /* return code variable */
    uint8_t i;
    uint32_t temp;

    if ((size & ((uint32_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE - 0x01U)) != 0x0U)
    {
       ret = FTFx_ERR_SIZE;
    }
    else
    {
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
        temp = pSSDConfig->DFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
        {
            dest = dest - temp + 0x800000U;
        }
        else
#endif
        {
            temp = pSSDConfig->PFlashBase;
            if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
            {
                dest -= temp;
            }
            else
            {
                ret = FTFx_ERR_ACCERR;
            }
        }
        while((size > 0x0U) && (FTFx_OK == ret))
        {
            /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
             CLEAR_FTFx_FSTAT_ERROR_BITS;
            /* passing parameter to the command */
#if (FSL_FEATURE_FLASH_FLEX_NVM_BLOCK_WRITE_UNIT_SIZE == FTFx_PHRASE_SIZE)
            FTFx_FCCOB0 = FTFx_PROGRAM_PHRASE;
#else
            FTFx_FCCOB0 = FTFx_PROGRAM_LONGWORD;
#endif
            FTFx_FCCOB1 = GET_BIT_16_23(dest);
            FTFx_FCCOB2 = GET_BIT_8_15(dest);
            FTFx_FCCOB3 = GET_BIT_0_7(dest);

            for (i = 0x0U; i <  FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE; i++)
            {
                temp = FTFx_BASE + i + 0x08U;
                *(uint8_t *)(temp) = pData[i];
            }

            /* calling flash command sequence function to execute the command */
            ret = pFlashCommandSequence(pSSDConfig);

            /* update destination address for next iteration */
            dest += FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE;
            /* update size for next iteration */
            size -= FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE;
            /* increment the source address by 1 */
            pData += FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE;
        }
    }
    return(ret);
}

