arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
/*
 * brief Flash program check
 *
 * This API tests a previously programmed P-Flash or D-Flash long word
 * to see if it reads correctly at the specified margin level. This
 * API always returns FTFx_OK if size provided by user is zero
 * regardless  of  the  input validation
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended program check operation.
 * param size:          Size in byte to check accuracy of program operation
 * param pExpectedData: The pointer to the expected data.
 * param pFailAddr:     Returned the first aligned failing address.
 * param marginLevel:   Read margin choice as follows:
 *                       marginLevel = 0x1: read at User margin 1/0 level.
 *                       marginLevel = 0x2: read at Factory margin 1/0 level.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashProgramCheck(const PFLASH_SSD_CONFIG pSSDConfig, \
                                                uint32_t  dest, \
                                                uint32_t  size, \
                                                uint8_t*  pExpectedData, \
                                                uint32_t* pFailAddr, \
                                                uint8_t   marginLevel, \
                                                pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{

    flash_drv_status_t ret;      /* return code variable */
    uint32_t offsetAddr ; /* offset address to convert to internal memory address */
    uint32_t temp;        /* temporary variable */
    uint8_t i;
    if ((size & ((uint32_t)FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT - 0x01U)) != 0x0U)
    {
        ret = FTFx_ERR_SIZE;

    }
    else
    {
        /* check if the destination is aligned or not */
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
        offsetAddr = pSSDConfig->DFlashBase;
        if((dest >= offsetAddr) && (dest < (offsetAddr + pSSDConfig->DFlashSize)))
        {
            dest = dest - offsetAddr + 0x800000U;
        }
        else
#endif
        {
            offsetAddr = pSSDConfig->PFlashBase;
            if((dest >= offsetAddr) && (dest < (offsetAddr + pSSDConfig->PFlashSize)))
            {
                dest -= offsetAddr;
            }
            else
            {
                ret = FTFx_ERR_ACCERR;
                size = 0x0U;
            }
        }
        while (size > (uint32_t)0x0U)
        {
            /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
            CLEAR_FTFx_FSTAT_ERROR_BITS;
            /* passing parameter to the command */
            FTFx_FCCOB0 = FTFx_PROGRAM_CHECK;
            FTFx_FCCOB1 = GET_BIT_16_23(dest);
            FTFx_FCCOB2 = GET_BIT_8_15(dest);
            FTFx_FCCOB3 = GET_BIT_0_7(dest);
            FTFx_FCCOB4 = marginLevel;

            for (i = 0x0U; i < FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT; i++)
            {
                temp = FTFx_BASE + i + 0x0CU;
                *(uint8_t *)(temp) = pExpectedData[i];
            }
            /* calling flash command sequence function to execute the command */
            ret = pFlashCommandSequence(pSSDConfig);

            /* checking for the success of command execution */
            if(FTFx_OK != ret)
            {
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
                if(dest >= 0x800000U)
                {
                    *pFailAddr = dest + offsetAddr - 0x800000U;
                }
                else
#endif
                {
                    *pFailAddr = dest + offsetAddr;
                }
                 size = FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT;
            }
            size -= FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT;
            pExpectedData += FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT;
            dest += FSL_FEATURE_FLASH_PFLASH_CHECK_CMD_ADDRESS_ALIGMENT;
        }
    }
    return(ret);
}

/*
 * brief Calculates check sum.
 *
 * This API  performs 32 bit sum of each byte data over a specified Flash
 * memory range without carry which provides rapid method for checking data integrity.
 * The  callback  time  period  of  this  API  is  determined  via  FLASH_CALLBACK_CS  macro  in the
 * SSD_FTFx_Common.h  which is used as a counter value for the CallBack() function calling in
 * this API. This value can be changed as per  the user  requirement. User can change  this value  to
 * obtain the maximum permissible callback time period.
 * This  API  always  returns  FTFx_OK  if  size  provided  by  user  is  zero  regardless  of  the  input
 * validation.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address of the Flash range to be summed
 * param size:          Size in byte of the Flash range to be summed
 * param pSum:          To return the sum value
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_RANGE)
 */
flash_drv_status_t FlashCheckSum(const PFLASH_SSD_CONFIG pSSDConfig, \
                                uint32_t dest, \
                                uint32_t size, \
                                uint32_t* pSum)
{
    uint32_t counter;          /* Counter for callback operation */
    uint32_t data;             /* Data read from Flash address */
    flash_drv_status_t ret = FTFx_OK;       /* Return code variable */
    uint32_t endAddress;       /* P Flash end address */

    counter = 0x0U;
    /* calculating Flash end address */
    endAddress = dest + size;

    /* check for valid range of the target addresses */
    if ((dest < pSSDConfig->PFlashBase) ||
        (endAddress > (pSSDConfig->PFlashBase + pSSDConfig->PFlashSize)))
    {
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
        if ((dest < pSSDConfig->DFlashBase) ||
        (endAddress > (pSSDConfig->DFlashBase + pSSDConfig->DFlashSize)))
        {
#endif
            ret = FTFx_ERR_RANGE;
            size = 0x0U;
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
        }

#endif /* End of if FSL_FEATURE_FLASH_HAS_FLEX_NVM */
    }
    *pSum = 0x0U;
    /* doing sum operation */
    while(size > 0x0U)
    {
        data = *(uint8_t *)(dest);
        *pSum += data;
        dest += 0x01U;
        size -= 0x01U;

        ++counter;
        /* Check if need to serve callback function */
        if(counter >= FLASH_CALLBACK_CS)
        {
            /* serve callback function if counter reaches limitation */
            if(NULL_CALLBACK != pSSDConfig->CallBack)
            {
                pSSDConfig->CallBack();
            }
            /* Reset counter */
            counter = 0x0U;
        }
    }
    return(ret);
}

#if FSL_FEATURE_FLASH_HAS_PROGRAM_SECTION_CMD
/*
 * brief Flash program section
 *
 * This API will program the data found in the Section Program Buffer
 * to previously erased locations in the Flash memory. Data is preloaded into
 * the Section Program Buffer by writing to the acceleration Ram and FlexRam
 * while it is set to function as a RAM. The Section Program Buffer is limited
 * to  the  value of FlexRam divides by a ratio. Refer to the associate reference
 * manual to get correct value of this ratio.
 * For derivatives including swap feature, the swap indicator address is encountered
 * during FlashProgramSection, it is bypassed without setting FPVIOL but the content
 * are not be programmed. In addition, the content of source data used to program to
 * swap indicator will be re-initialized to 0xFF after completion of this command.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended program operation.
 * param number:          Number of alignment unit to be programmed. Refer to associate
 *                       reference manual to get correct value of this alignment constrain.
 * param pFlashCommandSequence :  Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0, FTFx_ERR_RAMRDY)
 */
flash_drv_status_t FlashProgramSection(const PFLASH_SSD_CONFIG pSSDConfig, \
                                                uint32_t dest, \
                                                uint16_t number, \
                                                pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{

    flash_drv_status_t ret = FTFx_OK;      /* return code variable */
    uint32_t temp;

