arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
    /* check RAMRDY bit of the flash configuration register */
    if(0x0u == (FTFx_FCNFG & FTFx_FCNFG_RAMRDY_MASK))
    {
        /* return an error code FTFx_ERR_RAMRDY */
        ret = FTFx_ERR_RAMRDY;
    }
    else
    {
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
        temp = pSSDConfig->DFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
        {
            dest = dest - temp + 0x800000U;
        }
        else
#endif
        {
            temp = pSSDConfig->PFlashBase;
            if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
            {
                dest -= temp;
            }
            else
            {
                ret = FTFx_ERR_ACCERR;
            }
        }

        if(ret == FTFx_OK)
        {
            CLEAR_FTFx_FSTAT_ERROR_BITS;
            /* passing parameter to command */
            FTFx_FCCOB0 = FTFx_PROGRAM_SECTION;
            FTFx_FCCOB1 = GET_BIT_16_23(dest);
            FTFx_FCCOB2 = GET_BIT_8_15(dest);
            FTFx_FCCOB3 = GET_BIT_0_7(dest);
            FTFx_FCCOB4 = GET_BIT_8_15(number);
            FTFx_FCCOB5 = GET_BIT_0_7(number);

            /* calling flash command sequence function to execute the command */
            ret = pFlashCommandSequence(pSSDConfig);
        }
    }
    return(ret);
}

#endif

#if FSL_FEATURE_FLASH_HAS_ERASE_FLASH_BLOCK_CMD
/*
 * brief Flash erase block
 *
 * This API  erases all addresses in an individual P-Flash or D-Flash block.
 * For  the derivatives  including multiply  logical P-Flash or D-Flash blocks,
 * this API   erases a single block in a single call.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended erase operation.
 * param pFlashCommandSequence :  Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashEraseBlock (const PFLASH_SSD_CONFIG pSSDConfig, \
                        uint32_t dest, \
                        pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{

    flash_drv_status_t ret = FTFx_OK;       /* return code variable */
    uint32_t temp;      /* temporary variable */


    /* check if the destination is aligned or not */
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
    temp = pSSDConfig->DFlashBase;
    if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
    {
        dest = dest - temp + 0x800000U;
    }
    else
#endif
    {
        temp = pSSDConfig->PFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
        {
            dest -= temp;
        }
        else
        {
            ret = FTFx_ERR_ACCERR;
        }
    }

    if(FTFx_OK == ret)
    {
       /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
        CLEAR_FTFx_FSTAT_ERROR_BITS;
        /* passing parameter to the command */
        FTFx_FCCOB0 = FTFx_ERASE_BLOCK;
        FTFx_FCCOB1 = GET_BIT_16_23(dest);
        FTFx_FCCOB2 = GET_BIT_8_15(dest);
        FTFx_FCCOB3 = GET_BIT_0_7(dest);

        /* calling flash command sequence function to execute the command */
        ret = pFlashCommandSequence(pSSDConfig);
    }
    return(ret);
}
#endif
#ifdef FSL_FEATURE_FLASH_HAS_READ_1S_BLOCK_CMD
/*
 * brief Flash verify block
 *
 * This API  checks to see  if an entire P-Flash or D-Flash block has been
 * erased to the specified margin level
 * For  the derivatives  including multiply  logical P-Flash or D-Flash blocks,
 * this API   erases a single block in a single call.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended verify operation.
 * param marginLevel:   Read Margin Choice as follows:
 *                       marginLevel = 0x0: use Normal read level
 *                       marginLevel = 0x1: use the User read
 *                       marginLevel = 0x2: use the Factory read
 * param pFlashCommandSequence :  Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashVerifyBlock(const PFLASH_SSD_CONFIG pSSDConfig, \
                                   uint32_t dest, \
                                   uint8_t marginLevel, \
                                   pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret = FTFx_OK;      /* return code variable */
    uint32_t temp;

    /* check if the destination is aligned or not */
#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
    temp = pSSDConfig->DFlashBase;
    if((dest >= temp) && (dest < (temp + pSSDConfig->DFlashSize)))
    {
        dest = dest - temp + 0x800000U;
    }
    else
#endif
    {
        temp = pSSDConfig->PFlashBase;
        if((dest >= temp) && (dest < (temp + pSSDConfig->PFlashSize)))
        {
            dest -= temp;
        }
        else
        {
        ret = FTFx_ERR_ACCERR;
        }
    }
    if(FTFx_OK == ret)
    {
        /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
        CLEAR_FTFx_FSTAT_ERROR_BITS;
        /* passing parameter to the command */
        FTFx_FCCOB0 = FTFx_VERIFY_BLOCK;
        FTFx_FCCOB1 = GET_BIT_16_23(dest);
        FTFx_FCCOB2 = GET_BIT_8_15(dest);
        FTFx_FCCOB3 = GET_BIT_0_7(dest);
        FTFx_FCCOB4 = marginLevel;
        /* calling flash command sequence function to execute the command */
        ret = pFlashCommandSequence(pSSDConfig);
    }
    return(ret);
}

#endif

#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
/*
 * brief EERAM get protection
 *
 * This  API  retrieves  which  EEPROM  sections  of  FlexRAM  are  protected
 * against  program  and erase operations. Considering  the  time consumption
 * for getting protection is very low and even can be ignored, it is not necessary
 * to utilize the Callback function to support the time-critical events
 *
 * param protectStatus: To return the current value of the EEPROM
 *                       Protection Register. Each bit is corresponding to
 *                       protection status of 1/8 of the total EEPROM
 *                       use. The least significant bit is corresponding to
 *                       the lowest address area of EEPROM. The most
 *                       significant bit is corresponding to the highest
 *                       address area of EEPROM and so on. There are
 *                       two possible cases as below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_NOEEE)
 */
flash_drv_status_t EERAMGetProtection(uint8_t* protectStatus)
{
    flash_drv_status_t ret = FTFx_OK;      /* return code variable */
    /* Check if EERAM is set for EEE */
    if((FTFx_FCNFG & FTFx_FCNFG_EEERDY_MASK) == FTFx_FCNFG_EEERDY_MASK)
    {
        *protectStatus = FTFx_FEPROT;
    }
    else
    {
        ret = FTFx_ERR_NOEEE;
    }
    return(ret);
}
/*
 * brief EERAM set protection
 *
 * This API sets protection to the intended protection status for EEPROM us
 * area of FlexRam. This is subject to a protection transition restriction.
 * If there is a setting violation, it returns failed information and
 * the current protection status won’t be changed.
 *
 * param protectStatus: The intended protection status value should be
 *                       written to the EEPROM Protection Register.
 *                       Each bit is corresponding to
 *                       protection status of 1/8 of the total EEPROM
 *                       use. The least significant bit is corresponding to
 *                       the lowest address area of EEPROM. The most
 *                       significant bit is corresponding to the highest
 *                       address area of EEPROM and so on. There are
 *                       two possible cases as below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_NOEEE,FTFx_ERR_CHANGEPROT)
 */
flash_drv_status_t EERAMSetProtection(uint8_t protectStatus)
{
    flash_drv_status_t ret = FTFx_OK;       /* return code variable */
    /* Check if EERAM is set for EEE */
     if(0x0U == (FTFx_FCNFG & FTFx_FCNFG_EEERDY_MASK))
    {
        /* EERAM is not set for EEE */
        ret = FTFx_ERR_NOEEE;
    }
    else
    {

