arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
        FTFx_FEPROT = protectStatus;
        if ( protectStatus != FTFx_FEPROT)
        {
            ret = FTFx_ERR_CHANGEPROT;
        }
        else
        {
            /* do nothing */
        }
    }
    return(ret);
}
/*
 * brief Flash Set EEEEnable
 *
 * This function is used to change the function of the FlexRAM. When not
 * partitioned for EEPROM backup, the FlexRam is typically used as traditional
 * RAM. Otherwise, the FlexRam is typically used to store EEPROM data and user
 * can use this API to change its functionality according to his application requirement.
 * For example, after partitioning to have EEPROM backup, FlexRAM  is used  for EEPROM
 * use accordingly. And this API is used to set FlexRAM is available for
 * traditional RAM for FlashProgramSection() use.
 *
 * param pSSDConfig:               The SSD configuration structure pointer.
 * param EEEEnable:                FlexRam function control code. It can be:
 *                                  -  0xFF: make FlexRam available for RAM.
 *                                  -  0x00: make FlexRam available for EEPROM.
 * param pFlashCommandSequence:    Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t SetEEEEnable(const PFLASH_SSD_CONFIG pSSDConfig, uint8_t EEEEnable, pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{

    flash_drv_status_t ret;      /* return code variable */


    /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_SET_EERAM;
    FTFx_FCCOB1 = EEEEnable;
    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);
    return(ret);
}
/*
 * brief EEPROM Emulator Write
 *
 * This API is used to write data to FlexRAM section which is  partitioned
 * as EEPROM use for EEPROM operation. After data has been written to EEPROM
 * use section of FlexRAM, the EEPROM file system will create new data record
 * in EEPROM back-up area of FlexNVM in round-robin fashion.
 * There  is no alignment constraint for destination and size parameters
 * provided by user. However, according to user’s input provided, this
 * API will set priority to write to FlexRAM with following rules:
 * 32-bit writing is invoked if destination is 32 bit aligned and size
 * is not  less than 32 bits.
 * 16-bit writing is  invoked if destination is 16 bit aligned and size
 * is not  less than 16 bits.
 * 8-bit writing is invoked if destination is 8 bit aligned and size is not less than 8 bits.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param dest:          Start address for the intended write operation.
 * param size:          Size in byte to be written.
 * param pData:         Pointer to source address from which data
 *                       has to be taken for writing operation.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_RANGE, FTFx_ERR_NOEEE, FTFx_ERR_PVIOL)
 */
static flash_drv_status_t WaitEEWriteToFinish(uint32_t dest,\
                             const uint8_t* pData, uint8_t step)
{
    flash_drv_status_t ret;           /* return code variable */
    uint32_t temp;          /* temporary variable */

    if (0x01U == step)
    {
        *(uint8_t*)(dest) =  *pData;
    }
    if (0x02U == step)
    {
        temp = (uint32_t)(*(pData + 1)) << 8;
        temp |= (uint32_t)(*pData);

        *(volatile uint16_t *)(dest) =  (uint16_t)temp;
    }
    if (0x04U == step)
    {
        temp =  (uint32_t)(*(pData + 3)) << 24;
        temp |= (uint32_t)(*(pData + 2)) << 16;
        temp |= (uint32_t)(*(pData + 1)) << 8;
        temp |= (uint32_t)(*pData);
        *(volatile uint32_t *)(dest) = temp;
    }

    while(0x0u == (FTFx_FCNFG & FTFx_FCNFG_EEERDY_MASK))
    {
       /* wait till EEERDY bit is set */
    }
    /* Check for protection violation error */
    ret = (flash_drv_status_t)(FTFx_FSTAT & (FTFx_FSTAT_MGSTAT0_MASK|FTFx_FSTAT_FPVIOL_MASK \
                    |FTFx_FSTAT_ACCERR_MASK|FTFx_FSTAT_RDCOLERR_MASK));

    return ret;
}

flash_drv_status_t EEEWrite(const PFLASH_SSD_CONFIG pSSDConfig, \
                           uint32_t dest, \
                           uint32_t size, \
                           uint8_t* pData)
{
    flash_drv_status_t ret = FTFx_OK;           /* Return code variable */
    uint8_t i;
    /* Check if EEE is enabled */
    if((FTFx_FCNFG & FTFx_FCNFG_EEERDY_MASK) == FTFx_FCNFG_EEERDY_MASK)
    {
        /* check range */
       if((dest < pSSDConfig->EERAMBase) || \
          ((dest + size) > (pSSDConfig->EERAMBase + pSSDConfig->EEESize)))
        {
            ret = FTFx_ERR_RANGE;
        }

        while ((size > 0x0U) && (ret == FTFx_OK))
        {

            /* dest is 32bit-aligned and size is not less than 4 */
            if (((uint32_t)0x0u == (dest & (uint32_t)0x03U)) && (size >= 0x04U))
            {
                i = 0x04U;
            }
            else  if (((uint32_t)0x0u == (dest & (uint32_t)0x1U)) && (size >= 0x02U))
            {
                i = 0x02U;
            }
            else
            {
                i = 0x01U;

            }
            ret = WaitEEWriteToFinish(dest, pData, i);
            dest += i;
            size -= i;
            pData += i;

        }
    }
    else
    {
        ret = FTFx_ERR_NOEEE;
    }
    return(ret);
}
/*
 * brief Flash D/E-Flash Partition.
 *
 * This API prepares the FlexNVM block for use as D-Flash, EEPROM backup, or a combination
 * of both and initializes the FlexRAM.
 *
 * The single partition choice should be used through entire life time of a given
 * application to guarantee the Flash endurance and data retention of Flash module.
 *
 * param   pSSDConfig                The SSD configuration structure pointer
 * param   EEEDataSizeCode           EEPROM Data Size Code
 * param   DEPartitionCode           FlexNVM Partition Code
 * param   pFlashCommandSequence     Pointer to the Flash command sequence function.
 *
 * return  Successful completion(FTFx_OK)
 * return  Error value(FTFx_ERR_ACCERR, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t DEFlashPartition(const PFLASH_SSD_CONFIG pSSDConfig, \
                        uint8_t EEEDataSizeCode, \
                        uint8_t DEPartitionCode, \
                        pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret;      /* return code variable */
    /* clear RDCOLERR & ACCERR & FPVIOL & MGSTAT0 flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_PROGRAM_PARTITION;
    FTFx_FCCOB4 = EEEDataSizeCode;
    FTFx_FCCOB5 = DEPartitionCode;
    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);
    return(ret);
}
/*
 * brief D-Flash get protection.
 *
 * This API retrieves current P-Flash protection status. Considering the time consumption
 * for getting protection is very low and even can be ignored, it is not necessary to utilize
 * the Callback function to support the time-critical events.
 *
 * param   pSSDConfig                The SSD configuration structure pointer
 * param   protectStatus             To return the current value of the D-Flash Protection
 *                                    Register. Each bit is corresponding to protection status
 *                                    of 1/8 of the total D-Flash. The least significant bit is
 *                                    corresponding to the lowest address area of D-Flash. The
 *                                    most significant bit is corresponding to the highest address
 *                                    area of D-Flash and so on. There are two possible cases as below:
 *                                    - 0 : this area is protected.
 *                                    - 1 : this area is unprotected.
 *
 * return  Successful completion(FTFx_OK)
 * return  Error value(FTFx_ERR_EFLASHONLY)
 */
flash_drv_status_t DFlashGetProtection(const PFLASH_SSD_CONFIG pSSDConfig,uint8_t* protectStatus)
{
    flash_drv_status_t ret = FTFx_OK;
    /* Check if size of DFlash = 0 */
    if(pSSDConfig->DFlashSize == 0x0U)
    {
        ret = FTFx_ERR_EFLASHONLY;
    }
    else
    {
        *protectStatus = FTFx_FDPROT;
    }
    return(ret);
}

