arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flash/fsl_flash_driver_c90tfs.c
                if (swapContinue == true)
                {
                    /* Report current swap state */
                    ret = PFlashSwapCtl(pSSDConfig,addr,FTFx_SWAP_REPORT_STATUS,&currentSwapMode, \
                                        &currentSwapBlockStatus, &nextSwapBlockStatus , pFlashCommandSequence);
                }
            }
        }else
        {
            /* do nothing */
        }
        if ((NULL_SWAP_CALLBACK == pSwapCallback)&&(FTFx_SWAP_UPDATE == currentSwapMode))
        {
            /* Erase indicator sector in non active block to proceed swap system to update-erased state */
            ret = FlashEraseSector(pSSDConfig, addr + (pSSDConfig->PFlashSize >> 1),(uint32_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_SECTOR_SIZE , \
                                    pFlashCommandSequence);
            if (FTFx_OK == ret)
            {
                /* Now the swap state must be Update-Erased, so report current swap state */
                ret = PFlashSwapCtl(pSSDConfig,addr,FTFx_SWAP_REPORT_STATUS,&currentSwapMode, \
                                    &currentSwapBlockStatus, &nextSwapBlockStatus , pFlashCommandSequence);
            }
        }
        /* If current swap mode is Update or Update-Erased */
        if  (FTFx_SWAP_UPDATE_ERASED == currentSwapMode)
        {
            if (NULL_SWAP_CALLBACK == pSwapCallback)
            {
                swapContinue = true;
            }
            else
            {
                swapContinue = pSwapCallback(currentSwapMode);
            }

            if (swapContinue == true)
            {
                /* Progress Swap to COMPLETE State */
                ret = PFlashSwapCtl(pSSDConfig,addr,FTFx_SWAP_SET_IN_COMPLETE,&currentSwapMode, \
                &currentSwapBlockStatus, &nextSwapBlockStatus , pFlashCommandSequence);
            }
        }
    }
    return(ret);
}
/*
 * brief  Implements swap control command corresponding with the swap control code provided via the swapcmd parameter.
 *
 * param   pSSDConfig                The SSD configuration structure pointer
 * param   addr                      Address of swap indicator.
 * param   swapcmd                   Swap Control Code:
 *                                      0x01 - Initialize Swap System
 *                                      0x02 - Set Swap in Update State
 *                                      0x04 - Set Swap in Complete Stat
 *                                      0x08 - Report Swap Status
 * param   pCurrentSwapMode          Current Swap Mode:
 *                                      0x00 - Uninitialized
 *                                      0x01 - Ready
 *                                      0x02 - Update
 *                                      0x03 - Update-Erased
 *                                      0x04 - Complete
 * param   pCurrentSwapBlockStatus   Current Swap Block Status indicates which program Flash block
 *                                    is currently located at relative Flash address 0x0_0000
 *                                      0x00 - Program Flash block 0
 *                                      0x01 - Program Flash block 1
 * param   pNextSwapBlockStatus      Next Swap Block Status indicates which program Flash block
 *                                    is located at relative Flash address 0x0_0000 after the next reset.
 *                                      0x00 - Program Flash block 0
 *                                      0x01 - Program Flash block 1
 * param   pFlashCommandSequence     Pointer to the Flash command sequence function.
 *
 * return  Successful completion(FTFx_OK)
 * return  Error value(FTFx_ERR_ACCERR,FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t PFlashSwapCtl(const PFLASH_SSD_CONFIG pSSDConfig,uint32_t addr, uint8_t swapcmd,uint8_t* pCurrentSwapMode, \
                        uint8_t* pCurrentSwapBlockStatus, \
                        uint8_t* pNextSwapBlockStatus, \
                        pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret;      /* Return code variable */

    /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_PFLASH_SWAP;
    FTFx_FCCOB1 = GET_BIT_16_23(addr);
    FTFx_FCCOB2 = GET_BIT_8_15(addr);
    FTFx_FCCOB3 = GET_BIT_0_7(addr);

    FTFx_FCCOB4 = swapcmd;
    FTFx_FCCOB5 = 0xFFU;
    FTFx_FCCOB6 = 0xFFU;
    FTFx_FCCOB7 = 0xFFU;


    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);

    if (FTFx_OK == ret)
    {
        *pCurrentSwapMode = FTFx_FCCOB5;
        *pCurrentSwapBlockStatus = FTFx_FCCOB6;
        *pNextSwapBlockStatus = FTFx_FCCOB7;
    }
    return (ret);
}
#endif /* End of FSL_FEATURE_FLASH_HAS_PFLASH_BLOCK_SWAP */
#if FSL_FEATURE_FLASH_HAS_ERASE_ALL_BLOCKS_UNSECURE_CMD
/*!
 * brief Flash erase all Blocks unsecure.
 *
 * This API  erases all Flash memory,  initializes  the FlexRAM, verifies
 * all memory contents, and then releases the MCU security.
 *
 * param pSSDConfig:    The SSD configuration structure pointer.
 * param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * return Successful completion (FTFx_OK)
 * return Error value  (FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashEraseAllBlockUnsecure (const PFLASH_SSD_CONFIG pSSDConfig, \
                       pFLASHCOMMANDSEQUENCE pFlashCommandSequence)
{
    flash_drv_status_t ret;         /* return code variable */

    /* clear RDCOLERR & ACCERR & FPVIOL flag in flash status register. Write 1 to clear*/
    CLEAR_FTFx_FSTAT_ERROR_BITS;
    /* passing parameter to the command */
    FTFx_FCCOB0 = FTFx_ERASE_ALL_BLOCK_UNSECURE;

    /* calling flash command sequence function to execute the command */
    ret = pFlashCommandSequence(pSSDConfig);
    return(ret);
}
#endif /* End of FSL_FEATURE_FLASH_HAS_ERASE_ALL_BLOCKS_UNSECURE_CMD */

